<?php 
 
session_cache_limiter('private, must-revalidate');
session_start();

//------------------------------------------------------------------------------------------------
//   데이터베이스 연결설정 인자 (서버명, 사용자명, 비밀번호, 작업대상 데이터베이스명)
//------------------------------------------------------------------------------------------------
$hostName1 = "localhost"; // 
$userName1 = "root";
$userPassword1 = "Esrdev!@#38";
$dbName1 = "EsrCoinHunter";

//------------------------------------------------------------------------------------------------
//   데이터베이스에 연결한다.
//------------------------------------------------------------------------------------------------
$connect1 = @mysqli_connect($hostName1,$userName1,$userPassword1, $dbName1 );
if(!$connect1) {
   echo "DATABASE 연결 실패<br><br><br>";
   exit;
}

mysqli_set_charset($connect1, 'utf8');


?>
