<?php 
 
session_cache_limiter('private, must-revalidate');
session_start();

//------------------------------------------------------------------------------------------------
//   데이터베이스 연결설정 인자 (서버명, 사용자명, 비밀번호, 작업대상 데이터베이스명)
//------------------------------------------------------------------------------------------------
$hostName = "194.59.164.107"; //  "192.168.0.133";
$userName = "u986769382_root";
$userPassword = "123456";
$dbName = "u986769382_coinhunter";

//------------------------------------------------------------------------------------------------
//   데이터베이스에 연결한다.
//------------------------------------------------------------------------------------------------
$connect = @mysqli_connect($hostName,$userName,$userPassword, $dbName );
if(!$connect) {
   echo "DATABASE 연결 실패<br><br><br>";
   exit;
}

mysqli_set_charset($connect, 'utf8');



?>
