<?php



//--------------------------------------------------------------------------------------------------------
// SQL INJECTION 방지 : $_POST $_GET 전역에 stripslashes() 해준다.
//--------------------------------------------------------------------------------------------------------
/*
    php.ini의 magic_quotes_gpc = On 인 경우
    GPC 전역변수에 자동으로 슬래시가 붙어온다.
    이를 제거한 후 mysql_real_escape_string() 을 사용한다.
*/

if( get_magic_quotes_gpc() ) {
    $_POST = _stripslashes($_POST);
}
$_POST = array_map('_mysql_real_escape_string', $_POST);



if( get_magic_quotes_gpc() ) {
    $_GET = _stripslashes($_GET);
}
$_GET = array_map('_mysql_real_escape_string', $_GET);



//--------------------------------------------------------------------------------------------------------
// SQL INJECTION 방지 : $_POST $_GET 전역에 stripslashes() 해준다.
//--------------------------------------------------------------------------------------------------------







//--------------------------------------------------------------------------------------------------------
// SQL INJECTION 방지 : 특수문자를 에러처리한다.
//--------------------------------------------------------------------------------------------------------

// GET 변수에 허용되는 정상 문자열 이외의 특수문자는 모두 에러처리한다.

/*
	영문 알파벳 : a-z, A-Z
	숫자 : 0-9
	한글 : \x80-\xff
	기타 : 하이픈 - 언더바 _ 퍼센트기호 % 마침표 . 쉼표 ,
	* 퍼센트기호는 urlencode 되는 문자열(한글,공백 등)에 필요함
*/


/*
if( $_GET ) {
	foreach($_GET as $key=>$val) {
		//$pattern = "/^[a-zA-Z0-9\x80-\xff-_.,#+%]+$/";
		$pattern = "/^[-a-zA-Z0-9\x80-\xff_\s]*$/";


		if( _preg_match( $pattern,$key) ) {
		} else {
			echo "<script>alert('URL 요청에 올바르지 않은 값이 포함되어 있습니다.   '); history.back(); </script>\n";
			exit;
		}

		if( _preg_match( $pattern,$val) ) {
		} else {
			echo "<script>alert('URL 요청에 올바르지 않은 값이 포함되어 있습니다.   '); history.back(); </script>\n";
			exit;
		}
	}
}
*/



//--------------------------------------------------------------------------------------------------------
// SQL INJECTION 방지 : 특수문자를 에러처리한다.
//--------------------------------------------------------------------------------------------------------


?>